# GetWindowType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..GetWindowType Method
EnergyAnalysisOpening Class See Also
---
Gets the analytic window type this surface is associated with.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public EnergyAnalysisWindowType GetWindowType()
```

Visual Basic
---
```text
Public Function GetWindowType As EnergyAnalysisWindowType
```

Visual C++
---
```text
public:
EnergyAnalysisWindowType^ GetWindowType()
```

# ### Return Value
The analytic window type.
# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace